package com.minchen.august23;

public class DateLog {
//   给定n条日志，用英文分号分隔的字符串： 素材20220823.txt
//    日志格式分为几部分，说明如下：
//            1: 日期yyyy-mm-dd，保证日期都在一个月内
//    2: ip：.分格式，保证为合法ip(1.1.1.1和1.001.01.1为同一ip)
//    3: 访问url: 仅由字母、/ 、.、_、数字 组成
//    4: 访问是否成功，只有success fail 2种结果
//    求统计日活和月活：
//    日活：每天不同ip数访问/login.do且结果为success的数量
//    月活：每月不同ip数访问/login.do且结果为success的数量
//    输出 32个数：
//
//    第一个表示月活，后面31个数表示每天的日活
//    2 1 1 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
//            */
//
//    作者：匿名用户
//    链接：https://leetcode.cn/circle/discuss/KMZgQ4/
//    来源：力扣（LeetCode）
//    著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。
}
